Catalogs/Банки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Банки</Name>
			<Comment>(Общ) Классификатор банков</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Comment>(Регл) Корреспонденский счет банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РНН</Name>
					<Comment>Регистрационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВПлатежнойСистеме</Name>
					<Comment>Код банка в платежной системе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссии</Name>
					<Comment>(Регл) процент комиссионного вознаграждения банку</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИК</Name>
					<Comment>используется с 07.06.2010</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИКДоРеформыБанковскихСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВПлатежнойСистемеДоРеформыБанковскихСчетов</Name>
					<Comment>Код банка в платежной системе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Банки/Forms/УправляемаяФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("БИК") Тогда
		Объект.БИК = Параметры.БИК;
	КонецЕсли;
	Если Параметры.Свойство("БИКДоРеформыБанковскихСчетов") Тогда
		Объект.БИКДоРеформыБанковскихСчетов = Параметры.БИКДоРеформыБанковскихСчетов;
	КонецЕсли;
	Если Параметры.Свойство("Наименование") Тогда
		Объект.Наименование = Параметры.Наименование;
	КонецЕсли;
	Если Параметры.Свойство("Город") Тогда
		Объект.Город = Параметры.Город;
	КонецЕсли;
	Если Параметры.Свойство("КодВПлатежнойСистеме") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.КодВПлатежнойСистеме) Тогда
			Объект.КодВПлатежнойСистеме = Параметры.КодВПлатежнойСистеме;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("КодВПлатежнойСистемеДоРеформыБанковскихСчетов") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.КодВПлатежнойСистемеДоРеформыБанковскихСчетов) Тогда
			Объект.КодВПлатежнойСистемеДоРеформыБанковскихСчетов = Параметры.КодВПлатежнойСистемеДоРеформыБанковскихСчетов;
		КонецЕсли;
	КонецЕсли;
		
	оф_РеквизитыЭППЗаголовок = "Реквизиты электронного платежного поручения";
	оф_КонтактнаяИнформацияЗаголовок = "Контактная информация";	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Процедура - обработчик события "ПриИзменении" поля ввода "БИК"
//
&НаКлиенте
Процедура БИКПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.КодВПлатежнойСистеме) Тогда
		Объект.КодВПлатежнойСистеме = УправлениеДенежнымиСредствами.ПолучитьКодБанкаВПлатежнойСистеме(Объект.БИК);
	КонецЕсли;	
КонецПроцедуры // БИКПриИзменении

// Процедура - обработчик события "ПриИзменении" поля ввода "БИКДоРеформыБанковскихСчетов"
//
&НаКлиенте
Процедура БИКДоРеформыБанковскихСчетовПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.КодВПлатежнойСистемеДоРеформыБанковскихСчетов) Тогда
		Объект.КодВПлатежнойСистемеДоРеформыБанковскихСчетов = УправлениеДенежнымиСредствами.ПолучитьКодБанкаВПлатежнойСистеме(Объект.БИКДоРеформыБанковскихСчетов);
	КонецЕсли;	
КонецПроцедуры // БИКДоРеформыБанковскихСчетовПриИзменении

// Процедура - обработчик события "Нажатия" кнопки проверки РНН
//
&НаКлиенте
Процедура КнопкаПроверкиРНННажатие(Элемент)
	Если ОбщегоНазначения.РННСоответствуетТребованиям(Объект.РНН) Тогда
		Предупреждение("Введенный РНН корректен!");
	КонецЕсли;
КонецПроцедуры // КнопкаПроверкиРНННажатие()

// Процедура - обработчик события "Нажатия" кнопки проверки БИН
//
&НаКлиенте
Процедура КнопкаПроверкиБИННажатие(Элемент)
	Если ОбщегоНазначения.БИНИИНСоответствуетТребованиям(Объект.ИдентификационныйНомер) Тогда
		Предупреждение("Введенный БИН корректен!");
	КонецЕсли;
КонецПроцедуры // КнопкаПроверкиРНННажатие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

//Процедура- обработчик события "ПриЗакрытии" формы
//
&НаКлиенте
Процедура ПриЗакрытии()
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		ОповеститьОВыборе(Объект.Контрагент);
	КонецЕсли; 
КонецПроцедуры
